ErpTest/src/Documents/ЗаписьКУДиР/ЗаписьКУДиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьКУДиР</name>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходовРаздел2</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Строки</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа4</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа5</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа6</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа7</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВозникновенияРасходов</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ДвижениеПрочихАктивовПассивов</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПриобретениеУслугПоЛизингу</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.МаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.СписаниеЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>EnumRef.ВидыРасходовУСН</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>EnumRef.ВидыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоходЕНВД</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходЕНВД</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ДвижениеПрочихАктивовПассивов</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПриобретениеУслугПоЛизингу</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.МаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.СписаниеЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УменьшениеНалога</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПФР</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ФСС</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ФОМС</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ФСС_НС</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Больничные</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобровольноеСтрахование</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Строки2</name>
    <attributes>
      <name>ЭлементРасходов</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВозникновенияРасходов</name>
      <type>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа3_ДатаВводаВЭксплуатацию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа4_ГосударственнаяРегистрация</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа5_ПервоначальнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа6_ОстаточнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа7_СрокПолезногоИспользования</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа8_КолКварталовВОтчетномПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа9_КолКварталовВНалПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа10_ДоляРасходовЗаНалПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа11_ДоляРасходовЗаКвартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа12_СуммаРасходовЗаОтчетнПериод</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа13_СуммаРасходовЗаКвартал</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа14_РасходыПрошлыхПериодов</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа15_ОстатокРасходов</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа16_ДатаВыбытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УплаченныйТорговыйСбор</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТорговогоСбора</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Enums/ВидыРасходовУСН/ВидыРасходовУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасходовУСН</name>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
  <enumValues>
    <name>РБП</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыТовары</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
    <comment>НДС по приобретенным ценностям</comment>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыМатериалы</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиТовары</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиМатериалы</name>
  </enumValues>
  <enumValues>
    <name>Лизинг</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/ЗаписьКУДиР/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Добавляет команду создания документа "Запись книги учета доходов и расходов (УСН)".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаписьКУДиР) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаписьКУДиР.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаписьКУДиР);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Возврат; //В дальнейшем будет добавлен код команд
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создание запроса инициализации движений и заполенение его параметров
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	// Текст запроса, формирующего таблицы движений
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстЗапросаТаблицаКУДиР(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаКУДиР2(Запрос, ТекстыЗапроса, Регистры);
	
	// Выполение запроса и выгрузка полученных таблиц для формирования движений
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Организация КАК Организация
	|ИЗ
	|	Документ.ЗаписьКУДиР КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаКУДиР(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "КнигаУчетаДоходовИРасходов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Ссылка КАК Регистратор,
	               |	&Организация КАК Организация,
	               |	ДанныеДокумента.ДоходЕНВД,
				   |	ДанныеДокумента.Графа4,
	               |	ДанныеДокумента.Графа5,
	               |	ДанныеДокумента.РасходЕНВД,
				   |	ДанныеДокумента.Графа6,
	               |	ДанныеДокумента.Графа7,
	               |	ДанныеДокумента.НДС,
	               |	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	               |	ДанныеДокумента.ДатаНомер КАК РеквизитыПервичногоДокумента,
	               |	ВЫБОР
	               |		КОГДА ДанныеДокумента.ДокументВозникновенияРасходов = НЕОПРЕДЕЛЕНО
				   |				И НЕ ДанныеДокумента.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовУСН.ПустаяСсылка)
	               |			ТОГДА &Ссылка
	               |		ИНАЧЕ ДанныеДокумента.ДокументВозникновенияРасходов
	               |	КОНЕЦ КАК ДокументВозникновенияРасходов,
	               |	ДанныеДокумента.ВидРасходов КАК ВидРасходов,
				   |	ДанныеДокумента.СтатьяРасходов КАК Статья,
				   |	ДанныеДокумента.Партия КАК Партия,
	               |	ДанныеДокумента.Содержание КАК Содержание
	               |ИЗ
	               |	Документ.ЗаписьКУДиР.Строки КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка = &Ссылка";			   
				   
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаКУДиР2(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "КнигаУчетаДоходовИРасходовРаздел2";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Ссылка КАК Регистратор,
	               |	&Организация КАК Организация,
	               |	ДанныеДокумента.ЭлементРасходов,
	               |	ДанныеДокумента.ДатаОплаты,
	               |	ДанныеДокумента.Графа3_ДатаВводаВЭксплуатацию,
	               |	ДанныеДокумента.Графа4_ГосударственнаяРегистрация,
	               |	ДанныеДокумента.Графа5_ПервоначальнаяСтоимость,
	               |	ДанныеДокумента.Графа6_ОстаточнаяСтоимость,
	               |	ДанныеДокумента.Графа7_СрокПолезногоИспользования,
	               |	ДанныеДокумента.Графа8_КолКварталовВОтчетномПериоде,
				   |	ДанныеДокумента.Графа9_КолКварталовВНалПериоде,
				   |	ДанныеДокумента.Графа10_ДоляРасходовЗаНалПериод,
				   |	ДанныеДокумента.Графа11_ДоляРасходовЗаКвартал,
				   |	ДанныеДокумента.Графа12_СуммаРасходовЗаОтчетнПериод,
				   |	ДанныеДокумента.Графа13_СуммаРасходовЗаКвартал,
				   |	ДанныеДокумента.Графа14_РасходыПрошлыхПериодов,
				   |	ДанныеДокумента.Графа15_ОстатокРасходов,
				   |	ДанныеДокумента.Графа16_ДатаВыбытия,
	               |	ВЫБОР
	               |		КОГДА ДанныеДокумента.ДокументВозникновенияРасходов = НЕОПРЕДЕЛЕНО
	               |			ТОГДА &Ссылка
	               |		ИНАЧЕ ДанныеДокумента.ДокументВозникновенияРасходов
	               |	КОНЕЦ КАК ДокументВозникновенияРасходов
	               |ИЗ
	               |	Документ.ЗаписьКУДиР.Строки2 КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка = &Ссылка";			   
				   
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции "УправлениеПечатью.СоздатьКоллекциюКомандПечати".
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
